[
  {
    "title": "OSN+",
    "description": [
      "I joined Supercharge in 2021 and immediately started to work on the OSN+ project - a Netflix competitor - as a frontend developer.",
      "As part of a scrum team day to day I work on implementing new features, updating existing functionality, fixing bugs and even helping out teammates as often as I can."
    ],
    "badges": ["Angular14", "TypeScript", "NgRx", "RxJS"],
    "image": "osn.png",
    "demo-url": "https://osnplus.com/"
  },
  {
    "title": "Portfolio",
    "description": [
      "This portfolio website was built as a kind of masterwork to sum up the initial phase of my frontend development studies.",
      "Building on top of my HTML / CSS / ES6 / React foundation, I explore the realms of static-site-generation and utility-first CSS by utilizing Next.js and Tailwind respectively.",
      "I also utilized git & Github heavily, be sure to also check out all the issues and pull requests I wrote."
    ],
    "badges": ["Next.js", "SSG", "Tailwind CSS", "RWD"],
    "image": "portfolio.png",
    "github-url": "https://github.com/zsofiaflorek/portfolio",
    "demo-url": "https://zflorek.com"
  },
  {
    "title": "Weather app",
    "description": [
      "After a lot of JavaScript practice, I wanted to do something more significant than a \"Hello World\" project.",
      "The idea for the project comes from https://devchallenges.io and through it I learned the \"Thinking in React\" approach while trying Create React App.",
      "In addition to following the user stories and implementing the given Figma design, the task also required the use of an external API as the data source."
    ],
    "badges": ["Create React App", "React Router", "CSS Modules"],
    "image": "weatherapp.png",
    "github-url": "https://github.com/zsofiaflorek/weather-app",
    "demo-url": "https://weatherapp.zflorek.com/"
  },
  {
    "title": "404 Error",
    "description": [
      "This was the first step on my way to becoming a frontend engineer.",
      "After I had started to study basics of frontend development, I found this challenge on https://devchallenges.io.",
      "Based on a given design, the desktop and mobile versions had to be implemented for an example 404 page.",
      "Both the demo and the Github repo are available, check them out!"
    ],
    "badges": ["HTML5", "CSS3", "RWD"],
    "image": "error404.png",
    "github-url": "https://github.com/zsofiaflorek/portfolio-404",
    "demo-url": "https://404.zflorek.com"
  }
]
